# -*- coding: ひきこもり -*-
label Fl_start:
    $ Fl.StopSound(2)
    $ Fl.StopAmbience(2)
    $ Fl.StopMusic(2)
    $ serial = Fl.serial()
    jump prolog



label hent:
    scene cg Fl_hent_uri
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_al, "Нет, Аня, прекрати!")
    $ Fl.say(Fl_r, "Жар окутал всё моё тело. Внутри было необычайно горячо. Казалось будто внутри меня бушевал пожар.")
    $ Fl.say(Fl_r, "Аня подразнивала меня своими пальцами. Она нежными движениями заставляла чувствовать меня очень странно. И это пугало меня.")
    $ Fl.say(Fl_th, "Как всё могло дойти до этого...")   
    $ Fl.say(Fl_r, "Я осознавала, что это всё не правильно. Но мне почему-то это нравилось и в глубине души желала, чтобы Аня не останавливалась.")
    $ Fl.say(Fl_al, "Ах... Ммм...")
    $ Fl.say(Fl_r, "Я пыталась со всех сил сдерживать стоны, было дико неловко, а ещё нас мог кто-то услышать.")
    $ Fl.say(Fl_r, "Аня с удивлением посмотрела на меня, а после сделав хитрую улыбку, рукой обхватило мою грудь и губами обхватила сосок.")

    $ Fl.AttackMaster()
    $ Fl.say(Fl_al, "Нха! Ах!")
    $ Fl.say(Fl_al, "Аня, хватит! Давай остановимся! Ммм, ах...")
    $ Fl.say(Fl_r, "Но Аня только ускорила темп. Она ловко игралась с моей киской, то сгибая, то выпрямляя пальцы.")
    $ Fl.say(Fl_r, "Схватив свой галстук, я пыталась рукой прикрыть рот, сдерживать стоны я больше не могла.")
    $ Fl.say(Fl_r, "Моё тело стало ватное, внутри всё пылало.")
    $ Fl.say(Fl_al, "Я... Я сейчас...")
    $ Fl.say(Fl_r, "Но неожидано всё прекратилось.")
    $ Fl.say(Fl_r, "Я подняла опустила взгляд, Аня с ухмылкой сидела и смотрела на меня.")
    $ Fl.say(Fl_al, "Я ведь почти... {w}Кончила...")
    $ Fl.say(Fl_r, "Мне было очень стыдно говорить подобное, поэтому последнее слово я сказала шёпотом.")
    $ Fl.say(Fl_an, "Прости что ты сказала?")
    $ Fl.say(Fl_r, "Аня расплылась в улыбке.")
    $ Fl.say(Fl_th, "Да всё ты слышала!") 
    $ Fl.say(Fl_an, "Можешь повторить?")
    $ Fl.say(Fl_al, "Я ведь почти кончила! Зачем ты прекратила?")
    $ Fl.say(Fl_an, "Так тебе понравилось?")
    $ Fl.say(Fl_al, "Что? {w}Мне?! {w}Да ни капельки!", _with=hpunch)
    $ Fl.say(Fl_al, "Ну если совсем немного...")
    $ Fl.say(Fl_an, "Тогда может продолжим?")
    $ Fl.say(Fl_r, "Сказала Аня и подсела поближе, обхватив мою талию обеими руками.")
    $ Fl.say(Fl_th, "Слишком близко!")   
    $ Fl.say(Fl_r, "Я смущенно перевела взгляд в сторону.")
    $ Fl.say(Fl_an, "Ну если ты не хочешь...")
    $ Fl.say(Fl_al, "Хочу!")
    $ Fl.say(Fl_th, "Что я только что сказала?!")
    $ Fl.say(Fl_r, "Всё произошло слишком быстро, я уже не понимала что несу, мой разум затуманился, я просто хотела вновь ощутить те незабываемые чувства.")
    $ Fl.say(Fl_r, "Аня дотронулась до моего лица, проведя в конце по моим губам большим пальцем.")

    $ Fl.say(Fl_r, "Прикусив нижнюю губу, Аня ещё раз на меня посмотрела, а после закрыв глаза начала приближаться к моим губам.")
    $ Fl.say(Fl_r, "Сопротивления не было, я сама прильнула своими губами к её.")
    $ Fl.say(Fl_r, "Мы слились в страсном поцелуе. Наши языки разыгрались. С каждой секундой я желала Аню всё больше. Скрывать стоны больше не приходлилось, мне было теперь наплевать услышит нас кто-то или нет.")
    $ Fl.say(Fl_r, "Поцелуй затянулся. {w}Я медленно опустила свои руки вниз. И в ту же секунду мои пальцы оказались внутри моей киски. Теперь уже я игралась с собой.")
    $ Fl.say(Fl_r, "Но Аня вновь прервала всё. Она строго на меня посмотрела.")
    $ Fl.say(Fl_an, "Эгоистка...")
    $ Fl.say(Fl_an, "Почему ты только себя развлекаешь?!")
    $ Fl.say(Fl_th, "Видно Аня заметила чем я была занята во время поцелую...")
    $ Fl.say(Fl_r, "После чего Аня полезла к себе под рубашку. В последствии чего её лифчик полетел на пол.")
    $ Fl.say(Fl_r, "Я без слов поняла что нужно делать и, задрав Ане рубашку, я языком дотронулась до её упругого соска.")

    $ Fl.AttackMaster()
    $ Fl.say(Fl_an, "{b}Нха!!{/b}")
    $ Fl.say(Fl_al, "Ого, а что это за милый звук щас был?")
    $ Fl.say(Fl_r, "С ухмылкой спросила я. Теперь роль садистки пришлось принять мне.")
    $ Fl.say(Fl_an, "Тебе показалось, дура!")
    $ Fl.say(Fl_al, "Вот как...")
    $ Fl.say(Fl_r, "Мой язык повторил ранее действие. Я медленно водила им возле соска и иногда покусывала его, при этом обхватив саму грудь рукой.")
    $ Fl.say(Fl_r, "Стоны эхом раздавались в домике.")
    $ Fl.say(Fl_th, "Никогда не видела её такой...")
    $ Fl.say(Fl_th, "Какая же ты всё таки милашка!")
    $ Fl.say(Fl_r, "От стонов мне становилось дурно, я прям чувствовала как моя киска намокает, а сладкие соки текут по ляжкам.")
    $ Fl.StopMusic()
    $ Fl.HideScreens()
    $ Fl.PlaySound("Fl_open_dooor_campus_1", 1, 0, False)

    $ Fl.Pause(2.5)
    scene bg Fl_int_house_of_sl_day with Fl_dissolve2
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "Самый главный страх стал явью. Кто-то открыл дверь.")
    $ Fl.say(Fl_th, "Вот дуры! Мы дверь забыли закрыть!")
    $ Fl.say(Fl_r, "Я боялась поворачивать голову. Встретить кого-то из отряда одно, но если этим кто-то окажется вожатая, то это конец...")
    $ Fl.say(Fl_gg, "Так... лааадно. Я позже зайду.")
    $ Fl.say(Fl_r, "Этим кто-то оказался Ян - новенький, который приехал на неделю позже.")
    $ Fl.say(Fl_th, "Слава богу не вожатая...")
    $ Fl.say(Fl_r, "Но только сейчас до меня дошло, что мы полураздетые занимались непристойностями на глазах Парня!")
    $ Fl.say(Fl_r, "Стоило Яну развернутся, как Аня подскочила и моментально сократила дистанцию.")
    $ Fl.say(Fl_an, "Далеко собрался?")
    $ Fl.say(Fl_r, "Она быстро развернула Яна на 180 градусов и схватила за шиворот футболки.")
    $ Fl.say(Fl_r, "Яну это очень не понравилось.")
    $ Fl.say(Fl_gg, "Не парьтесь я никому ничего не расскажу. Ну наверное...")
    $ Fl.say(Fl_an, "И ты сейчас просто хотел уйти?")
    $ Fl.say(Fl_gg, "Ну да...")
    $ Fl.say(Fl_an, "Боже ты такой идиот!")
    $ Fl.say(Fl_an, "На самом деле Ян нам очень нужна твоя помощь, надеюсь ты понимаешь о какой помощи я прошу?")
    $ Fl.say(Fl_r, "После чего Аня схватила руку Яна. {w}Он ухмыльнулся")
    $ Fl.say(Fl_gg, "Если расскажу я могила!")
    $ Fl.say(Fl_r, "После чего Аня отпустила его руку и уселась обратно на кровать.")
    $ Fl.say(Fl_r, "Аня жестом подозвала Яна к себе. {w}После чего он закрыл уже дверь на ключ и направился к нам.")
    $ Fl.say(Fl_th, "О чём это вы там договорились?! И почему Ян до сих пор здесь?!")
    $ Fl.say(Fl_r, "Когда Ян подошёл, Аня встала на цыпочки, а после сделала то чего я вообще не могла ожидать.")

    $ Fl.say(Fl_r, "Поцеловала его!")




label prolog:
    $ Fl.Save("Пролог: Предыстория.")
    $ Fl.DayTime("prologue", "prologue")
    scene bg Fl_black with Fl_dissolve2
    $ Fl.Pause(4.0)

    $ Fl.PlayMusic("Fl_titr2", 1, 2)
    scene Fl_intro1:
        ease 10.0 zoom 1.2 xalign 0.8 yalign 0.5
    show Fl_intro_text1 at Fl_name_move(1.0, -0.11, 0.35)
    show Fl_intro_text2 at Fl_name_move(1.0, -0.11, 0.35)
    with Fl_dissolve2

    $ Fl.Pause(7.5)
    $ Fl.StopMusic(2)
    scene bg Fl_black with Fl_dissolve3


    $ Fl.Pause(5.5)
    $ Fl.PlayAmbience("Fl_bizzard_inside", 1, 4)
    scene Fl_room_gg_snow_zad  
    show Fl_snow at Fl_linear_effects_repeat(0.7, 0.75, 0.7, 0.75, 0.25, 0.3, 0.25)
    show Fl_room_gg_snow
    with Fl_dissolve3
    $ Fl.PlayMusic("Fl_poligon", 1, 4)
   
    $ Fl.Status("depression", False)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.Pause(2)
    $ Fl.GlobalDict("Fl_complete", "inventory", True)
    $ Fl.say(Fl_r, "А начиналось всё с того, что я сидел у пыльного монитора и думал о смысле жизни. {w}Уже в который раз{mn}")
    $ Fl.say(Fl_th, "Зачем?")
    $ Fl.say(Fl_th, "Просто вряд ли кто-то сможет дать на это точный ответ{mn}")
    $ Fl.say(Fl_th, "Собственно и я в том числе.")
    $ Fl.say(Fl_th, "Смысл - это лишь пустые догадки, которые являются по сути ничем.")
    $ Fl.say(Fl_th, "Смысл - всего лишь поиск оправдания наших целей, желаний. Наших действий... {w}Смысл должен быть везде. Но так ли это?")
    $ Fl.say(Fl_th, "Какой же вообще смысл во всём, что мы делаем?")
    

    $ Fl.say(Fl_th, "Учимся.")
    $ Fl.say(Fl_th, "Ищем себе хобби.")
    $ Fl.say(Fl_th, "Поступаем куда-нибудь.")
    $ Fl.say(Fl_th, "Устраиваемся на работу.")
    $ Fl.say(Fl_th, "В конечном счёте, мы живём ищя во всём смысл, но нужно ли его искать там где по факту он и не нужен?")
    $ Fl.say(Fl_th, "Нормальный смысл жизни человека - прожить детство, а после грызя гранит знаний устроиться на хорошую работу. Добившись материального благополучия, нужно создать семью, чтобы на старости кто-то подал стакан воды.")
    $ Fl.say(Fl_th, "А в конце мы получаем счастливую смерть{mn}")
    $ Fl.say(Fl_th, "Для нормального человека - это и есть смысл жизни.")
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "Пока я размышлял, за окном буйно шёл снег.")
    $ Fl.say(Fl_r, "Орда снежинок, тихо постукивала в немытое окно, тем самым развеевая скукоту в моём сердце.")
    $ Fl.say(Fl_r, "Как раз начало декабря, если верить календарю.")
    $ Fl.say(Fl_r, "Я ненавидел зиму. Противное время года, холода, снега, длинные ночи.")
    $ Fl.say(Fl_r, "Но имеет ли сейчас для меня это значение? Если каждый день, как заевщая пластина граммофона...")
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_th, "Точно{mn} {w=0.8}Смысл жизни, да?")
    $ Fl.say(Fl_r, "Для меня это пустое слово, которое утратило какую-либо роль в моей жизни. Ещё будучи 16 летним подростоком для меня почти всё потеряло смысл.")
    $ Fl.say(Fl_r, "Я потерял кое-что важное, а если быть точнее кое-кого... {w}Подругу детства.")
    $ Fl.say(Fl_r, "Эту жизнерадостную, умную, добрую и хрупкую девушку, которая когда-то смогла изменить меня в лучшую сторону...")
    $ Fl.say(Fl_r, "Маша{mn}")
    $ Fl.say(Fl_r, "До встречи с ней, я был обычным быдлом, который прогуливал уроки и издевался над слабыми.")
    $ Fl.say(Fl_r, "У нас не было ничего общего. Но почему то она захотела со мной подружиться.")
    $ Fl.say(Fl_r, "«Потому что внутри ты добрый.» - именно эти слова заставили посмотреть на себя с другой стороны, разглядеть то что закопано глубоко внутри моего чёрствого сердца.")

    $ Fl.Pause(1.0)

    $ Fl.say(Fl_r, "Ежедневное общение с ней смогло меня исправить, дать цель в жизни, наполнить её каким-то смыслом.")
    $ Fl.say(Fl_r, "Я больше не прогуливал уроки и не шатался с разными придурками, которые прожигали свою жизнь на алкоголь и сигареты.")
    $ Fl.say(Fl_r, "Теперь же я хотел добиться чего-то в своей жизни, усердным трудом.")
    $ Fl.say(Fl_r, "Маша всегда была готова помочь и поддержать в трудную минуту. Разделяла со мной общие интересы, которых как оказалось у нас было предостаточно. Была готова болтать с утра до ночи.")
    
    $ Fl.Pause(1.0)

    $ Fl.say(Fl_r, "Несмотря на такого уровня близость, мы не планировали становиться парочкой. Нам нравился и нынешний уровень общения. Со стороны даже казалось, будто мы брат и сестра. А порой мы так и считали.")
    $ Fl.say(Fl_r, "Хочется ещё упомянуть, что с рождения у меня талант к творческому виду деятельности. И без неё эта тема тоже не прошла стороной. По сути творчество - являлось главным общим интересом.")
    $ Fl.say(Fl_r, "Маша хорошо писала, а я рисовал. Мы оба вкладывали душу в своё хобби, потому что хотели удивить и порадовать друг друга.")
    $ Fl.say(Fl_r, "Маше всегда нравились мои рисунки, каждый раз она смотрела на моё творение, как маленький ребёнок на конфету. Хотя это можно сказать и про меня, когда я читал её рукопись, я будто выпадал из реальности, погружаясь в написанное и вчитываясь в каждую строчку.")
    $ Fl.say(Fl_r, "Да, тогда я был самым счастливым человеком. Казалось пока со мной Маша, то мне всё поплечу.")
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(2.0)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "Вот только я не смог защитить ту, что стала для меня самым близким человеком. Из-за меня от яркой улыбки хрупкой девочки остался лишь след.")
    $ Fl.say(Fl_r, "Я не замечал проблем Маши, хотя и понимал, что что-то не так. Я просто верил в её - «Всё в порядке».")
    $ Fl.say(Fl_r, "Когда наступали серые дни в моей жизни, Маша всегда была рядом и поддерживала, игнорировав мою наигранную улыбку. А когда потребовалось помощь ей, я не смог оказаться рядом(а может и не хотел).")
    $ Fl.say(Fl_r, "Учились мы в разных классах, поэтому я не знал, что происходит с ней во время уроков.")
    $ Fl.say(Fl_r, "Это произошло под конец 10 класса, за 3 недели до летних каникул. На Машу начал выливаться негатив всех девушек в классе, в том числе и её подруг. Каждый день ей говорили гадости и надсмехались.")
    $ Fl.say(Fl_r, "Я не знал об этом, ведь слеповерил её лучезарной улыбке при каждой встречи.")
    $ Fl.say(Fl_r, "Несмотря на все издёвки, при мне она всегда была жизнерадостной и ввела себя как ни в чём не бывало.")

    $ Fl.Pause(1.5)
    
    $ Fl.say(Fl_r, "Уже как неделю Маша перестала посещать школу. Уже как неделю мы ни разу не встретились, только переписывались. И только тогда я понял, что что-то случилось, но подруга всё так же отвечала мне привычным набором текста: «Всё в порядке».")
    $ Fl.say(Fl_r, "Первые дни я проявлял настойчивость, но потом сдался, решив что просто раздуваю из мухи слона.")

    $ Fl.Pause(2.0)

    $ Fl.say(Fl_r, "«Прости меня, мне так жаль...» - всплыло на экране моего телефона. После чего я сразу же рванул к ней, несмотря на то что время перевалило далеко за полночь.")

    $ Fl.Pause(1.5)

    $ Fl.say(Fl_th, "Я опоздал...")
    $ Fl.say(Fl_r, "В тот день от лучезарной улыбки подруги детства остался лишь пустой взгляд.")
    $ Fl.say(Fl_th, "Говорят, у бога есть чувство юмора. {w}И я с данным мнением людей, пожалуй, согласился бы.")
    $ Fl.say(Fl_th, "Да, чувство юмора-то у него определённо есть.")
    $ Fl.say(Fl_th, "Но сам его юмор весьма и весьма жесток.")
    $ Fl.say(Fl_th, "Зачем он что-то в этой жизни даёт, если потом может тут же безвозратно забрать...")
    $ Fl.say(Fl_th, "Как раз в тот момент я и поверил в существование бога.")
    $ Fl.say(Fl_th, "Но не для того, чтобы молиться ему.")
    $ Fl.say(Fl_th, "Нееет... {w=0.7}А для того, чтобы его проклинать...")
    $ Fl.say(Fl_th, "Хотя больше я всё же проклинал себя. Именно из-за моего эгоизма, пострадал самый близкий человек.")
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "После смерти Маши, что-то сломалось внутри меня. {w}Даже нет - не просто сломалось, а умерло.")
    $ Fl.say(Fl_r, "Моя жизнь координально изменилась. Всё пошло по наклонной.")
    $ Fl.say(Fl_r, "Я посмотрел на своё запясте, где красовался уродливый шрам. Этот шрам появился в тот же день, после моего неудачного суицида. Теперь это клеймо останется горким воспоминанием о том раковом дне.")
    $ Fl.say(Fl_r, "Тогда я погрузился в отчаяние, депрессия окутала мой разум. Длительная терапия у психолога не пошла мне на пользу. Ведь ни один врач на планете не смог бы вернуть мне подругу.")
    $ Fl.say(Fl_r, "Теперь все мои цели и мечты потеряли какой-либо смысл. Всё что казалось до боли простым, перестало получаться, всё шло на перекосяк.")
    $ Fl.say(Fl_r, "Самое противное, что пока дорогой человек рядом с нами, мы не ценим его. Считаем это нормой, что так и должно быть. И только потеряв его, начинаем ценить.")
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "Что же было дальше?")
    $ Fl.say(Fl_r, "Ну не смотря на все трудности, я не бросил школу и закончил 11 классов, сдав экзамены на средний бал.")
    $ Fl.say(Fl_r, "А дальше просто сидел на шее родителей. Оплатить учёбы было не чем, ведь семейный бюджет у нас был скудный. Изначально я планировал сдать экзамены на высший бал, чтобы поступить на бюджет... Но я не смог заставить себя вновь учиться и ежедневно посещать школу - это отразилось на моём результате.")
    $ Fl.say(Fl_r, "До 18 лет, я заперся в своей комнате, полностью погрузив себя в творчество: музыка, рисование, новеллы и т.д.")
    $ Fl.say(Fl_r, "И знаете моё затворничество принесло результаты, я смог зарабатывать на своих рисунках. Конечно доход был копеешный, но на пропитание хватало.")
    $ Fl.say(Fl_r, "Поднакопив круглую сумму, я решил съехать от родителей. Они хоть и делали вид что всё нормально, но я понимал, что обременяю их своих присуствием.")
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "Мой переезд на маленькую однушку дал мне надежду на шанс начать всё сначала. Хотелось вновь попробовать усердно достигнуть чего-то в этой жизни, без чей либо помощи.") 
    $ Fl.say(Fl_th, "Как же это было наивно с моей стороны...")

    $ Fl.Pause(1.0)

    $ Fl.say(Fl_r, "Денег с творчества, как я говорил, было мало, чтобы оплатить в следующем месяце жильё. Так что искать работу было первоначальной целью.") 
    $ Fl.say(Fl_r, "С моим образованием я мог устроиться только консультантом или в мак.") 
    $ Fl.say(Fl_r, "Но я даже с этим не справился...") 
    $ Fl.say(Fl_r, "Несмотря на то что я выжимал максимум на работе, все мои усилия оборачивались против меня, словно бумерангом. {w}Я бросал его, но жизнь не давала возможности его поймать.")
    $ Fl.say(Fl_r, "Выговоры, вычитание из зарплаты из-за косяков, отработки в выходные. Я пахал за урезаную плату, которой хватало только на жильё.")
    $ Fl.say(Fl_r, "Из-за постоянных неудач я стал другим. Неудачи - ломали меня изнутри, кривя мою душу. {w}Высказав всё что я думаю о боссе и его семье, меня вышвырнули на улицу, незаплатив ни копейки за месяц.")
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_th, "Думаю вы и сами догадались, что заплатить за моё уютное гнёздышко мне было нечем.") 
    $ Fl.say(Fl_r, "И в тот же день после уволнения, я оставил ключи от квартиры в почтовом ящике, предупредив хозяйку. На душе было хреново, будто тысяча иголок каждую секунду вонзались в моё сердце. Спектр чувств регенирировались возле уже казалось родной многоэтажки.") 
    $ Fl.say(Fl_r, "Но иного выхода не было, кроме как оставить всё позади и плыть по течению...") 
    $ Fl.say(Fl_r, "Следующим моим пристанищем стала квартира друга.") 
    $ Fl.say(Fl_th, "Да-да даже у такого неудачника, как я, остались друзья...") 
    $ Fl.say(Fl_r, "У Серёги - так звали моего друга, я прожил ровно две недели.") 
    $ Fl.say(Fl_r, "Первую неделю мы веселились и бухали, что сильно раздаржало его девушку. Неудивительно, ведь она считала меня ничтожеством, которое не должно общаться с её парнем.")
    $ Fl.say(Fl_r, "Собственно из-за неё мне после второй недели моего затворничества у друга пришлось собрать монатки.")
    $ Fl.say(Fl_r, "Она дала мне деньги и предупредила чтобы я сваливал пока она хоть какую-то материальную поддержку даёт. А если быть точнее услышал я нечто подобное:") 
    $ Fl.say(Fl_r, "«Слушай, ты должен уйти и оставить Серёжу в покое. Я дам тебе денег. Если откажешься то я сделаю так чтобы ты вылетел на улицу. Так что не усложняй, бери деньги и больше не общайся с Серёжей! {i}Если тебе плевать на свою жизнь, то не порть её другим!{/i}»") 
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_th, "Стерва!") 
    $ Fl.say(Fl_r, "Старый диалог снова всплыл в моей памяти, заставив стиснуть от злости зубы. Последние слова меня добили. Но она была права...") 
    
    $ Fl.Pause(1.5)
    
    $ Fl.say(Fl_r, "И вот время близилось к зиме, я полностью разбитый и униженный от собственного бичевая, протягиваю красные купюры женщине.") 
    $ Fl.say(Fl_th, "Точно хозяйка{mn}") 
    
    $ Fl.Pause(1.0)
    
    $ Fl.say(Fl_h, "Молодой человек, откройте дверь! Заплатите за 2 месяца проживания или выметайтесь из квартиры!") 
    $ Fl.say(Fl_h, "{b}Молодой человек, откройте дверь! Я знаю, что вы там!{/b}", _with=hpunch)
    $ Fl.say(Fl_r, "Да в данный момент пока я тут расуждаю о смысле жизни самим с собой, ко мне ломиться хозяйка.")
    $ Fl.say(Fl_r, "Оно и неудивительно. Она думала, что пустила порядочного человека.")
    $ Fl.say(Fl_th, "Вот только какой я нахрен порядочный человек?!") 
    $ Fl.say(Fl_th, "Эта квартира стала моей тюрьмой в которой я доживаю свои последние деньки. Я больше не пытался идти вверх - просто сдался, заплутав где-то в двоичном коде. Моим адом стала всемирная сеть, где я коротал свои вечара за просмотром аниме и играми.") 
    $ Fl.say(Fl_th, "Как я и говорил в самом начале искать смысл это одно, а потерять его это... {w}страшно.")
    $ Fl.say(Fl_th, "Я больше не блуждал в ответах на самые банальные вопросы, я просто укутался в одеяло. В очень колючее одеяло - самобичевания и внутренного разложения. Но оно спасало меня от страшного монстра - серая реальность.")
    $ Fl.say(Fl_th, "Виртуальный мир стал моим спасением, он сжал меня в свои объятия и заполнял пробелы моей искалеченой души.")
    
    $ Fl.Pause(1.5)
    
    $ Fl.say(Fl_th, "Вот только это счастье тоже стоило мне денег. Поэтому я уже неделю как сижу без интернета и роюсь в своей голове.")
    $ Fl.say(Fl_th, "Вместе с интернетом пропал и мой крошечный доход с рисовашек, которые давали мне возможность хотя бы закупиться бич пакетами.")
    $ Fl.say(Fl_th, "Как же я прожил столько не платя за аренду?")
    $ Fl.say(Fl_th, "Всё просто, я врал. Первый месяц соврал, что моя мать попала в больницу и ей срочно нужны деньги. Второй месяц - «На работе зарплату задерживают». А потом просто игнор.")
    
    $ Fl.Pause(1.5)
    
    $ Fl.say(Fl_th, "Как вам моя история? {w}Правда отвратительна?") 
    $ Fl.say(Fl_th, "Ведь в ней я сам виноват. {w}Виноват в том что сейчас нахожусь в такой заднице.")
    $ Fl.say(Fl_th, "Кто я теперь? Обычный {u}хикка{/i}, который отгородился от всех. {u}Хикка{/u}, который возненавидел себя, из-за своей слабости.")
    $ Fl.say(Fl_th, "Если бы я был главным героем какой-то новеллы, то непременно был бы худшим гг за всю историю. Куда там, любой недоумок из гаремника был бы интереснее меня.")
    $ Fl.HideScreens(_with=Fl_dissolve1)


    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "Пока я размышлял, стуки в дверь прекратились.")
    $ Fl.say(Fl_th, "Интересно, когда она уже вызовет слесаря, чтобы выудить меня из квартиры? {w}Хотя это было её ошибка отдать мне ключи от квартиры, не сделав копию.")
    $ Fl.say(Fl_th, "Ладно хватит с меня размышлений... {w}это утомляет...") 
    $ Fl.say(Fl_th, "Нужно проветриться.")
    $ Fl.say(Fl_r, "Я встал из кресла, бросив напоследок взгляд на ярлык с отсуствующим интернетом.")
    $ Fl.say(Fl_r, "Вздохнув, я начал искать наушники и телефон, который зарядить у меня уже не было возможности. Последняя зарядка сгорела сегодня утром.")
    $ Fl.HideScreens(_with=Fl_dissolve1)

    $ Fl.Save("Пролог: Роемся в хламе.")

    jump Fl_prologue_room_items_start


label Fl_prologue_room_items:
    scene Fl_room_gg_snow_zad  
    show Fl_snow at Fl_linear_effects_repeat(0.7, 0.75, 0.7, 0.75, 0.25, 0.3, 0.25)
    show Fl_room_gg_snow
    with pushright
    jump Fl_prologue_room_items_start


label Fl_prologue_room_items_start:
    call screen Fl_clicked_scenes with Fl_dissolve1


label Fl_prologue_kitchen_items:
    scene Fl_kitchen_layer
    show Fl_snow at Fl_linear_effects_repeat(0.7, 0.75, 0.7, 0.75, 0.25, 0.3, 0.25)
    show Fl_kitchen_gray
    with pushleft
    jump Fl_prologue_kitchen_items_start


label Fl_prologue_kitchen_items_start:
    call screen Fl_prologue_kitchen_clicked with Fl_dissolve1



label Fl_prologue_room_items_check1:
    $ Fl.Pause (0.5)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_th, "Проверю, пожалуй, этот шкафчик.")
    $ Fl.HideScreens()
    $ Fl.PlaySound("Fl_open_cupboard", 1, 0, False)
    $ Fl.Pause (2.0)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_th, "Нашёл!")
    $ Fl.Item("headphones")
    $ Fl.Pause (1.0)
    $ Fl.say(Fl_r, "Наушники лежали сверху различного барахла, которго скопилось немало за пару месяцев.")
    $ Fl.HideScreens(_with=Fl_dissolve1)
    $ it_0 += 1
    $ hp += 1
    if hp >=1 and ph >=1:
        jump Fl_prologue_cnt
    else:
        jump Fl_prologue_room_items_start


label Fl_prologue_room_items_check2:
    $ Fl.Pause (0.5)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_th, "Проверю, пожалуй, этот шкафчик.")
    $ Fl.HideScreens()
    $ Fl.PlaySound("Fl_open_cupboard", 1, 0, False)
    $ Fl.Pause (2.0)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_r, "Перерыв всё подряд в бардаке, я ничего не обнаружил.")
    $ Fl.HideScreens(_with=Fl_dissolve1)
    $ it_1 += 1
    jump Fl_prologue_room_items_start


label Fl_prologue_room_items_check3:
    $ Fl.Pause (0.5)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_th, "Старый советский холодильник. Порой пугает своим гудением, но привыкнуть можно.")
    $ Fl.say(Fl_th, "Правда, свою функцию он уже давно не выполняет. Стоит мне поплнить запасы, как я тут же их съедаю. Максимум что можно найти в морозилке - примёрзшую пачку пельмешей.")
    $ Fl.HideScreens(_with=Fl_dissolve1)
    $ it_2 += 1
    jump Fl_prologue_room_items_start

 
label Fl_prologue_room_items_check4:
    $ Fl.Pause (0.5)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_th, "Моя дакимакура, которую я приобрёл на китайском рынке.")
    $ Fl.say(Fl_th, "Наудвиление принт отличного качества, а на таможне никто не решил проверить что в посылке. {w}Так бы может щас проживал в комнате для каждого лоликонщика.")
    $ Fl.say(Fl_th, "То есть за решёткой...")
    $ Fl.HideScreens(_with=Fl_dissolve1)
    $ it_3 += 1
    jump Fl_prologue_room_items_start


label Fl_prologue_room_items_check5:
    $ Fl.Pause (0.5)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_th, "Отличное железо, выполняет любую работу на ура.")
    $ Fl.say(Fl_th, "Правда без интернета, кроме косынки и залипания в папке «Домашка», делать в нём нечего.")
    $ Fl.HideScreens(_with=Fl_dissolve1)
    $ it_4 += 1
    jump Fl_prologue_room_items_start


label Fl_prologue_kitchen_items_check1:
    $ Fl.Pause (0.5)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_th, "Этот плакат мне подогнал Серёга на день рождение.")
    $ Fl.say(Fl_r, "«Булочка - оружие сопротивления» - так гласила Фурудэ Ханю(аниме тянка на плакате).")
    $ Fl.say(Fl_th, "Да уж. От булочки я бы не отказался...")
    $ Fl.HideScreens(_with=Fl_dissolve1)
    $ it_5 += 1
    jump Fl_prologue_kitchen_items_start


label Fl_prologue_kitchen_items_check2:
    $ Fl.Pause (0.5)
    $ Fl.ShowScreens(_with=Fl_fast)
    $ Fl.say(Fl_r, "На столе лежит мой старенький айфон.")
    $ Fl.Item("phone")
    $ Fl.Pause (1.0)
    $ Fl.say(Fl_th, "Да уж, оставлять телефон где попало моя тема...")
    $ Fl.HideScreens(_with=Fl_dissolve1)
    $ it_6 += 1
    $ ph += 1
    if hp >=1 and ph >=1:
        jump Fl_prologue_cnt
    else:
        jump Fl_prologue_kitchen_items_start




label Fl_prologue_cnt:
    $ Fl.Pause(1.0)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "После того как все мои гаджеты для вылазки были найдены я направился в коридор.")
    $ Fl.say(Fl_r, "Осталось только надеть старое пальто, которое уже давно не спасало от холода. Но чем богаты тем и рады.")
    $ Fl.HideScreens(_with=Fl_dissolve1)

    $ Fl.PlaySound("Fl_pause_time", 1.0, 2, False)
    scene Fl_pause
    with Fl_effect_time_pause


    $ Fl.Save("Пролог: За покупками.")
    $ Fl.Pause (3.5)
    scene bg Fl_black with Fl_dissolve2
    $ Fl.Pause (1.5)
    
    $ Fl.PlayAmbience("Fl_bizzard_outside", 1, 2)
    scene bg Fl_city:
        subpixel True
        parallel:
            xanchor 0.5 yanchor 0.5 xpos 0.5 ypos 0.5
            ease 0.5 zoom 1.04 xpos 0.5 ypos 0.49
        parallel:
            ease 0.5 xpos 0.5 ypos 0.492
            ease 0.5 xpos 0.484 ypos 0.508
            ease 0.5 xpos 0.5 ypos 0.492
            ease 0.5 xpos 0.516 ypos 0.508
            repeat
    show Fl_snow at Fl_linear_effects_repeat(0.7, 0.75, 0.7, 0.75, 0.25, 0.3, 0.25)
    with Fl_dissolve3


    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.AutoSave()
    $ Fl.say(Fl_r, "На улице стоял, пробиравший до дрожи, сильный мороз. А сильная буря сковывала движения, заставляя постоянно щуриться и прятать лицо под воротник.")
    $ Fl.say(Fl_r, "Неудивительно, что людей так мало.")
    $ Fl.say(Fl_th, "И почему же мне дома не сидится?")
    $ Fl.say(Fl_th, "Интересно сколько сейчас градусов?")
    $ Fl.say(Fl_r, "По пути задумался я.")
    $ Fl.say(Fl_r, "Моя рука автоматом начала рыться в кармане.")
    $ Fl.say(Fl_r, "Взглянув на экран полу-сдохшего телефона, я вспомнил о самой главной проблеме.")
    $ Fl.say(Fl_th, "Точно, инета нет...")
    $ Fl.say(Fl_r, "Тяжёлый вздох и я переключаю трек. {w}Пост-панк - идеально подошёл к этой серой, мрачной атмосфере забытого богом района.")
    $ Fl.say(Fl_r, "Шаг за шагом, я громко продавливал снег под своими ногами.")
    $ Fl.HideScreens(_with=Fl_dissolve1)
 

    $ Fl.Pause(2.0)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_th, "Конец близок, да?")
    $ Fl.say(Fl_r, "Задал я сам себе вопрос, скривив что-то похожее на улыбку.")
    $ Fl.say(Fl_r, "Сегодня точно не мой день, подумал я покосив взгляд на карман, в котором лежал мой старенький айфон. Он как и я доживает последние мгновения.")
    $ Fl.say(Fl_r, "Вот только он вновь увидит будущее, после небольшой подзарядки. А я нет.")
    $ Fl.say(Fl_r, "Шаг, ещё шаг и невольно мои руки начинают сжиматься в кулак.")
    $ Fl.say(Fl_r, "Моей тоске поспособствовал жалкий клочок бумажки, который я нашёл у себя под дверью.")
    $ Fl.say(Fl_r, "«Я вернусь завтра за деньгами. Если их не будет, то вызову полицию. Подпись:Хозяйка.»")
    $ Fl.say(Fl_th, "Без денег, так ещё и без жилья остался?")
    $ Fl.say(Fl_r, "Грустная улыбка нарисовалась на моём лице. Нет даже не так. Уставшая от всего, улыбка.")
    $ Fl.say(Fl_r, "Я ждал чего-то подобного, но я надеялся что это случится хотя бы немного попозже. Терпение у людей не железное и это нормально. Но моя детская наивность решила, что всё будет хорошо и я смогу и дальше жить под крышой на халяву до самого конца.")
    $ Fl.say(Fl_r, "Вытянув перед собой последнюю пятисотую купюру, я решил на финал закатить пир. {w}Скорее всего это моя последняя трапеза, поэтому хотелось прикупить что-нибудь вкусненькое.")
    $ Fl.say(Fl_th, "Забавно, я ведь даже не заработал эти деньги. Просто нашёл их на земле пару дней назад.")
    $ Fl.say(Fl_r, "Интернет отключили, следовательно вместе с ним пропал и мой крошечный доход. Повторно выдвинул я умозаключение.")

    $ Fl.Pause(1.0)
    $ Fl.say(Fl_th, "Я мог бы вернуться к родителям... {w}но не хочу вновь докучать им своим жалким существованием.")
    $ Fl.say(Fl_th, "Ну вернусь я и что дальше? {w}Сяду на шею и буду последние деньги с их пенсии на старости с них трясти?")
    $ Fl.say(Fl_th, "Нет, лучше бомжевать в метро или на заброшке какой-то ошиваться, там я хотя бы никому не помешаю.")
    $ Fl.say(Fl_r, "Мои размышления прервал опенинг какого-то аниме, с энергичным мотивом.")
    $ Fl.say(Fl_r, "Натянув пальто потуже, я ускорился.")
    $ Fl.HideScreens(_with=Fl_dissolve1)

    $ Fl.PlaySound("Fl_pause_time", 1.0, 2, False)
    scene Fl_pause
    with Fl_effect_time_pause


    $ Fl.Pause (3.5)
    scene bg Fl_black with Fl_dissolve2
    $ Fl.Pause (1.5)
    scene bg Fl_city with Fl_dissolve2:
        subpixel True
        parallel:
            xanchor 0.5 yanchor 0.5 xpos 0.5 ypos 0.5
            ease 0.5 zoom 1.04 xpos 0.5 ypos 0.49
        parallel:
            ease 0.5 xpos 0.5 ypos 0.492
            ease 0.5 xpos 0.484 ypos 0.508
            ease 0.5 xpos 0.5 ypos 0.492
            ease 0.5 xpos 0.516 ypos 0.508
            repeat
    show Fl_snow at Fl_linear_effects_repeat(0.7, 0.75, 0.7, 0.75, 0.25, 0.3, 0.25)


    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "И вот я, светясь от радости, иду домой. Хотелось в конце поесть нормально, за столиком в уютной обстановке.")
    $ Fl.say(Fl_r, "Мой взгляд упал на пакет с продуктами. Затарился я слабо, но за то как! Курочка, картошка, кетчуп и бутылка пива - мой ужин на сегодня.")
    $ Fl.say(Fl_r, "Грёзы о сытной трапезе развеивали все тревоги моего унылого будущего.")
    $ Fl.say(Fl_r, "Человека на улицу выгоняют, у человека денег нет, у человека нет ничего больше в этой жизни. А он радуется...")
    $ Fl.say(Fl_r, "Пока я любовался ночной красотой пустого района, под ногами нарисовался пешеходный переход.")
    $ Fl.say(Fl_r, "Ещё немного и я в последний раз увижу старую восьмиэтажную панельку.")
    $ Fl.say(Fl_th, "Что ж надеюсь хозяйка не заявится с самого утра.")
    $ Fl.say(Fl_th, "Не хотелось бы вещи в попыхах собирать. Хотя кроме моего пк и моника с авито у меня ничего не было. {w}Но! Я могу его продать и прожить хотя бы ещё месяц. А если повезёт и зиму переживу.")
    $ Fl.say(Fl_r, "Размышляя о своём, я увидел на дороге кота.")
    $ Fl.say(Fl_r, "Это пушистое создание треслось от холода и медленно перебирая лапами переходило дорогу.")
    $ Fl.say(Fl_r, "Мне стало жалко бедное животное, хотелось согреть остатком своего тепла, приласкать, поделиться своим ужином. Дать ему то, что в данный момент хотел я. {w}Стать для него кем-то особенным, как когда-то для меня стала Маша...")
    $ Fl.say(Fl_r, "Не обращая внимания на светофор, я направился к коту.")
    $ Fl.StopMusic(1)
    $ Fl.HideScreens(_with=Fl_dissolve1)
    $ Fl.PlaySound("Fl_avaria", 1.0, 0, False)
    scene bg Fl_black with Fl_flash 
    $ Fl.StopAmbience(3)


    $ Fl.Save("Пролог: Авария.")
    $ Fl.DayTime("nightmare", "nightmare")
    $ Fl.Pause (1.0)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.Status("-10")
    $ Fl.Status("critical", False)
    $ Fl.say(Fl_r, "И каково было мое удивление, когда меня ослепила яркая вспышка фар.")
    $ Fl.say(Fl_r, "В следующий миг меня приложило так, что я, описав несколько оборотов вокруг своей оси, отлетел назад и приземлился в грязный размокший снег. Боль сковала всё мое тело.")
    
    $ Fl.PlaySound("Fl_bones_breaking", 1.0, 0, False)
    scene bg Fl_moon_red1 with Fl_flash_red
    
    $ Fl.PlayMusic("Fl_important_negotiations", 1, 8)
    
    $ Fl.say(Fl_r, "Мой затуманенный взгляд застыл на яркой луне, которую мне с трудом удавалось фокусировать. Ещё проклятый снег падал прямо в глаза.")
    $ Fl.say(Fl_r, "Я постарался повернуть голову, чтобы разглядеть что именно переломало мне все кости. Но давалась это с огромным трудом. Из-за адской боли я искусал всю нижнюю губу.")
    $ Fl.say(Fl_r, "Но мне всё же мне удалось разглядеть автобус и водителя, который по всей видимости пытался до меня достучаться.")
    $ Fl.say(Fl_r, "Бессполезно. Реальность отправилась в мут, даже музыка из наушников играла безвучно, поэтому сейчас меня уже никто не смог бы потревожит.")
    $ Fl.say(Fl_r, "Стиснув зубы, я поднял голову обратно. Последнее что попало в моё полезрение пакет из пятёрочки с расбросанными продуктами.")
    $ Fl.say(Fl_th, "Вот и поужинал...")
   
    scene bg Fl_moon_red2 with Fl_dissolve3
   
    $ Fl.say(Fl_r, "Боль начала отходить на задний план, но картинка становилась всё темнее.")
    $ Fl.say(Fl_th, "Ха. Вот он мой хэппи энд, да?")
    
    $ Fl.Pause (1.5)
    
    $ Fl.say(Fl_th, "Интересно если бы я тогда успел, оказался во время, сложилась бы моя жизнь по-другому?")
    $ Fl.say(Fl_th, "Стал бы я хорошим человеком? {w}Или хотя бы счастливым?")
    $ Fl.say(Fl_th, "{cps=27}Смог бы я спасти её{break}{/cps}")
    $ Fl.say(Fl_th, "Нет! {w}Нет у меня сил чтобы сейчас размышлять о будущем, которому не сужденно было никогда сбыться. Давно надо было это понять.", _with=hpunch)
    $ Fl.say(Fl_th, "Да и поправде говоря, я рад что наконец-то этот ад закончился...")
    $ Fl.say(Fl_th, "Хотя может всё только начинается? Говорят после смерти нас ждёт рай или ад. Хотя в моём случаи только спуск в тартар...")
    $ Fl.say(Fl_th, "Ну надеюсь мне не придётся долго осваиваться, котелок для грешников сам смогу найти.")
    $ Fl.say(Fl_r, "Глаза начали потихоньку закрываться, отдавая меня в объятия тьмы. {w}От этой тьмы мне становилось спокойнее, а душу согревало незнакомое тепло...")
    $ Fl.say(Fl_th, "Хватит уже с меня... {w}Я уже год назад погиб вместе с Машей.")
    $ Fl.say(Fl_th, "Поэтому я просто хочу умереть в {i}тишине{/i}...")
    
    $ Fl.Pause (1.5)
    
    $ Fl.say(Fl_r, "Вдруг на ощуп я почувствовал что-то пушистое и мягкое.")

    $ Fl.Pause (1.0)

    $ Fl.say(Fl_th, "Хах. Значит ты жив. {w}Я рад...")
    $ Fl.say(Fl_th, "Точно, я ведь когда побежал, то кот сразу рванул прямо и его не задел автобус.")
    $ Fl.say(Fl_r, "Из последних сил, аккуратным движением я попытался погладить животное, но вышло это так себе.")

    $ Fl.Pause (1.5)

    $ Fl.say(Fl_th, "Здесь и закончится моя история, возле дороги на грязном снегу в луже собственной крови.")
    $ Fl.HideScreens(_with=Fl_dissolve1)
 
    $ Fl.Pause(1.0)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_th, "Если после смерти действительно что-то есть, то я неприменно хотел бы стать главным героем фентези мира, где меня постречает большегрудая эльфийка, ну или красотка принцесса, вообщем без разницы, просто красавица.")
    $ Fl.say(Fl_r, "Не знаю почему в моей голове зарождалось столько глупостей. Возможно из-за того что в глубине души я не хотел умерать и мой инстинкт самосахроненния боролся за мою жалкую жизнь до самого конца, или я всё же глупый по природе.")
    $ Fl.say(Fl_r, "А ответ прост, на место боли меня парализовал страх и отчаяние. Меня пугало, что я уже еле вижу это большое белое пятно в небе, пугало моё остывающее тело. {w}{b}Я не хотел умирать!{/b}")
    
    scene bg Fl_black with Fl_dissolve2 
    
    $ Fl.Pause (1.5)
    $ Fl.say(Fl_th, "Маша, прости{mn} {w=0.6}В следующей жизни я обещаю, что исправлюсь! Обещаю, что не буду вести себя как идиот! Обещаю, что не сдамся...")
    $ Fl.HideScreens(_with=Fl_dissolve1)
 

    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_kt, "П-пожа-алуйста, кто-нибудь, п-по-пом-могит-те{mn}")
    $ Fl.HideScreens(_with=Fl_dissolve1)
    
    $ Fl.StopMusic(7)
    $ Fl.DayTime("rain", "rain")
    $ Fl.Pause (11.5)


    $ Fl.Save("Пролог: 0101010101")
    $ Fl.PlayMusic("Fl_medicating", 1, 10)
    $ Fl.Status("")
    scene Fl_ext_camp_entrance_night_vision
    show Fl_smoke
    show Fl_entrance_night_vision_layer
    with Fl_dissolve4

    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.AutoSave()
    $ Fl.say(Fl_r, "...Я неожиданно очнулся...", cps="20")
    $ Fl.say(Fl_r, "Очнулся... {w}неизвестно где...", cps="25")
    $ Fl.say(Fl_r, "Перед собой я видел лишь... {w}непроглядную тьму.", cps="25")
    $ Fl.say(Fl_r, "Тьму... {w}и...", cps="25")
    $ Fl.HideScreens()
    
    hide Fl_entrance_night_vision_layer with Fl_dissolve5

    $ Fl.Pause(2.0)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "...Какие-то ворота?", cps="25")
    $ Fl.say(Fl_r, "Какие-то неизвестные мне ворота... {w}собственно как и всё вокруг меня...", cps="25")
    $ Fl.say(Fl_r, "Я... {w}не мог ничего вспомнить... {w}ни как сюда попал... {w}ни что это за место... {w}ни себя самого...", cps="25")
    $ Fl.say(Fl_r, "В голове... {w}всё будто в тумане... {w}Словно... {w}я потерял память? {w}Или я и до этого ничего не помнил?..", cps="25")
    $ Fl.say(Fl_r, "Кто же я? {w}Что же я здесь делаю? {w}Где все? {w}Или кто это «все»? {w}Что же происходит?", cps="25")
    $ Fl.say(Fl_r, "Я попытался напрячь память.", cps="25")
    $ Fl.say(Fl_r, "Попытался вспомнить хотя бы что-нибудь.", cps="25")
    $ Fl.say(Fl_r, "Но всё тщетно...", cps="25")
    $ Fl.say(Fl_r, "Мыслей... {w}словно не было... {w}Только пустота и ничего более...", cps="25")
    $ Fl.say(Fl_r, "...", cps="25")
    $ Fl.PlaySound2("Fl_gg_echo", 1.0, 0, False)
    $ Fl.say(Fl_kt, "Кто...", cps="25")
    $ Fl.PlaySound2("Fl_gg_echo2", 1.0, 0, False)
    $ Fl.say(Fl_kt, "Нибудь...", cps="25")
    $ Fl.say(Fl_r, "Подал голос я... {w}но услышал в ответ лишь собственное тихое эхо...", cps="25")
    $ Fl.say(Fl_r, "...", cps="25")
    $ Fl.PlaySound2("Fl_gg_echo3", 1.0, 0, False)
    $ Fl.say(Fl_kt, "Есть кто...", cps="25")
    $ Fl.PlaySound2("Fl_gg_echo4", 1.0, 0, False)
    $ Fl.say(Fl_kt, "Живой?", cps="25")
    $ Fl.say(Fl_r, "Я всё не прекращал попытаться докричаться хотя бы до кого-нибудь...", cps="25")
    $ Fl.say(Fl_r, "Только вот вместо крика у меня получался лишь... {w}какой-то невнятный хрип...", cps="25")
    $ Fl.say(Fl_r, "Поняв же, что это всё не принесёт мне никакого проку... {w}Я попытался... {w}сделать шаг вперёд...", cps="25")
    $ Fl.say(Fl_r, "Только вот... {w}никакого шага так и не произошло...", cps="25")
    $ Fl.say(Fl_r, "Моё тело отказывалось меня слушать...", cps="25")
    $ Fl.say(Fl_r, "Я не мог сделать... {w}ни единого движения...", cps="25")
    $ Fl.say(Fl_r, "Будто я парализован... {w}Но как?!", cps="25")
    $ Fl.say(Fl_r, "Если я и правда парализован, то... {w}как я сейчас стою на ногах?", cps="25")
    $ Fl.say(Fl_r, "Как это возможно?", cps="25")
    $ Fl.say(Fl_r, "Хотя... {w}что именно можно подразумевать под словом «возможно»?", cps="25")
    $ Fl.say(Fl_r, "Вот бы вспомнить...", cps="25")
    $ Fl.say(Fl_r, "Вспомнить... {w}хотя бы что-нибудь...", cps="25")
    $ Fl.HideScreens(_with=Fl_dissolve1)
 

    show Fl_ext_camp_entrance_night_vision_uvao with Fl_dissolve5
    $ persistent.Fl_photo_pallery_2 = True

    $ Fl.Pause(1.5)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_ktv, "...Ты...", cps="25")
    $ Fl.say(Fl_ktv, "...ен...", cps="25")
    $ Fl.say(Fl_ktv, "...Её...", cps="25")
    $ Fl.say(Fl_ktv, "...сти...", cps="25")
    $ Fl.say(Fl_r, "Перед глазами появился силуэт... {w}Женский силуэт...", cps="25")
    $ Fl.PlaySound2("Fl_gg_echo", 1.0, 0, False)
    $ Fl.say(Fl_kt, "Кто...", cps="25")
    $ Fl.PlaySound2("Fl_gg_echo5", 1.0, 0, False)
    $ Fl.say(Fl_kt, "Ты...", cps="25")
    $ Fl.say(Fl_ktv, "...ен...", cps="25")
    $ Fl.say(Fl_ktv, "...пот...", cps="25")
    $ Fl.say(Fl_ktv, "...ко...", cps="25")
    $ Fl.say(Fl_ktv, "...мож...", cps="25")
    $ Fl.say(Fl_ktv, "...мочь...", cps="25")
    $ Fl.PlaySound2("Fl_gg_echo6", 1.0, 0, False)
    $ Fl.say(Fl_kt, "Что...", cps="25")
    $ Fl.say(Fl_ktv, "...ен...", cps="25")
    $ Fl.say(Fl_ktv, "...нать...", cps="25")
    $ Fl.say(Fl_ktv, "...ую...", cps="25")
    $ Fl.say(Fl_ktv, "...вду...", cps="25")
    $ Fl.say(Fl_r, "Но вместо внятного ответа... {w}вновь раздались лишь обрывки каких-то фраз...", cps="25")
    $ Fl.say(Fl_ktv, "...Они...", cps="25")
    $ Fl.say(Fl_ktv, "...сны...", cps="25")
    $ Fl.say(Fl_ktv, "...они...", cps="25")
    $ Fl.say(Fl_ktv, "...сти...", cps="25")
    $ Fl.say(Fl_r, "И снова я ничего из этого не смог разобрать...", cps="25")
    $ Fl.HideScreens(_with=Fl_dissolve1)
 

    show Fl_ext_camp_entrance_night_vision_uvao at Fl_bg_zoom_th(1.0, 1.1, 4.0, 0.5, 0.5, 1.0, 1.0)

    $ Fl.Pause(3.0)
    $ Fl.ShowScreens(_with=Fl_dissolve1)
    $ Fl.say(Fl_r, "Силуэт медленно подошёл ко мне... {w}И протянув руку, заговорил уже более разборчиво:", cps="25")
    $ Fl.say(Fl_ktv, "Ты...", cps="25")
    $ Fl.say(Fl_ktv, "Пойдёшь...", cps="25")
    $ Fl.say(Fl_ktv, "Со...", cps="25")
    $ Fl.say(Fl_ktv, "Мной?..", cps="25")
    $ Fl.HideScreens(_with=Fl_dissolve1)

    menu:
        "Да, пойду.":
            $ Fl.say(Fl_r, "Я же... {w}в надежде получить хоть какие-то ответы... {w}не долго думая, ответил:", cps="25")
            $ Fl.PlaySound2("Fl_gg_echo7", 1.0, 0, False)
            $ Fl.say(Fl_kt, "Да...", cps="25")
            $ Fl.PlaySound2("Fl_gg_echo8", 1.0, 0, False)
            $ Fl.say(Fl_kt, "Я пойду с тобой...", cps="25")
            $ Fl.say(Fl_r, "На миг... {w}способность управлять телом вновь вернулась ко мне...", cps="25")
            $ Fl.say(Fl_r, "И когда я схватил тёплую ладонь силуэта...", cps="25")
            $ Fl.HideScreens()

            $ Fl.StopMusic(5)
            scene bg Fl_black with Fl_dissolve1
            $ Fl.ShowScreens(_with=Fl_dissolve1)
            $ Fl.say(Fl_r, "Тьма окутала меня в свои объятия...", cps="25")
            $ Fl.HideScreens(_with=Fl_dissolve1)
            $ Fl.Pause(1.5)
            jump day_1


        "Нет, я останусь здесь.":
            $ Fl.say(Fl_r, "В ответ же... {w}я решил просто помотать головой... {w}не решаясь куда-либо идти...", cps="25")
            $ Fl.say(Fl_r, "Девушка на миг взгрустнула...", cps="25")
            scene bg Fl_black with Fl_dissolve2
            $ Fl.say(Fl_r, "И расстворилась в темноте...", cps="25")
            $ Fl.say(Fl_r, "А после...", cps="25")
            $ Fl.HideScreens(_with=Fl_dissolve1)

            $ Fl.Pause(1.0)
            $ Fl.PlayAmbience("Fl_bizzard_inside", 1, 3)
            scene Fl_room_gg_snow_zad  
            show Fl_snow at Fl_linear_effects_repeat(0.7, 0.75, 0.7, 0.75, 0.25, 0.3, 0.25)
            show Fl_room_gg_snow
            show Fl_entrance_night_vision_layer
            with Fl_dissolve3

            $ Fl.ShowScreens(_with=Fl_dissolve1)
            $ Fl.say(Fl_r, "Я оказался в другом месте...", cps="25")
            $ Fl.say(Fl_r, "В месте... {w}где всё и началось...", cps="25")
            $ Fl.StopMusic(5)
            $ Fl.say(Fl_r, "И где теперь всё... {w}и закончится...", cps="25")
            $ Fl.say(Fl_r, "А точнее... {w}уже закончилось...", cps="25")
            $ Fl.Status("0")
            $ Fl.Status("death", False)
            $ Fl.Pause(1.0)
            $ Fl.HideScreens(_with=Fl_dissolve1)
            $ Fl.StopAmbience(3)
            scene bg Fl_black with Fl_dissolve2
            $ Fl.Pause(1.0)
            jump game_over




    return
